# -*- coding:utf-8 -*-
import csv
dict1 = {"定性定量封装交付部": "信息屏障赋能交付部", "降维打击抓手交付部": "平台化打法交付部", "结果导向话术交付部": "端到端共创部", "便捷性发力交付部": "颗粒度横向交付部", "颗粒度反哺部": "颗粒度加速交付部", "端到端心力部": "引爆点兼容部", "引爆点共创组": "平台化打通部", "短平快沉淀交付部": "影响力给到交付部", "WXG规模组": "资源倾斜扩展交付部", "颗粒度围绕交付部": "资源倾斜协同部", "复用打法聚合交付部": "定性定量聚合交付部", "信息屏障规模交付部": "一致性渗透组", "强化认知横向部": "影响力穿梭交付部", "引爆点补位部": "一致性发力交付部", "精细化加速部": "颗粒度拆解部", "护城河反晡交付部": "感知度纽带部", "精细化复用交付部": "感知度集成部", "新生态刺激部": "差异化闭环部", "结构化维度部": "强化认知试点组", "WXG反晡部": "复用打法基因交付部", "底层逻辑履约组": "资源倾斜包装交付部", "交付价值融合部": "WXG场景部", "如何收口分装交付部": "微信开拓交付部", "WXG分层交付部": "端到端话术部", "WXG拆解部": "WXG载体组", "新生态打通交付部": "差异化调性组", "颗粒度落地部": "平台化聚焦组", "端到端分装交付部": "组合拳打透交付部", "点线面话术部": "定性定量破圈部", "WXG共建部": "快速响应闭环交付部", "复用打法渗透组": "归因分析破圈部", "定性定量穿梭交付部": "便捷性晌应交付部", "顶层设计刺激交付部": "差异化提炼交付部", "组合拳共创交付部": "护城河包装交付部", "精细化兼容部": "感知度输出部", "WXG抽象部": "感知度反哺交付部", "影响力布局交付部": "端到端格局交付部"}
list1 = list(dict1.keys())
list2 = list(dict1.values())
print(list1)
print(list2)

f = open('../csv/1.md', mode='w', encoding='UTF-8')
f.write('```mermaid\n')
f.write('graph LR;\n')
for i in range(len(dict1)):
    a = list2[i]
    b = '-->'
    c = list1[i]
    d = ';\n'
    f.write(a + b + c + d)
f.write('```\n')
f.close()
